stubs/__files/partner/psl/read_equipment_49_30_179_76G2.xml

<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<SOAP:Envelope xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/'>
    <SOAP:Header/>
    <SOAP:Body>
        <ns1:MT_EQDATA_RESPV2 xmlns:ns1='http://telekom.de/xi/NGERP_EXTD_PSL_INT/global/WMS/Equipment/Read/V2'>
            <eiMessageContext>
                <target xmlns='http://messaging.ei.tmobile.net/datatypes'>SI_ReadEquipmentResponseV2In_DigiOSS</target>
                <requestId xmlns='http://messaging.ei.tmobile.net/datatypes'>
                    urn:uuid:f27e56e8-d7fc-4613-8386-4da56507e6d6
                </requestId>
                <timeLeft xmlns='http://messaging.ei.tmobile.net/datatypes'>172800000</timeLeft>
                <priority xmlns='http://messaging.ei.tmobile.net/datatypes'>4</priority>
                <sender xmlns='http://messaging.ei.tmobile.net/datatypes'>sndr:tmo.erp.sap.architecture.SAP:PI</sender>
                <correlationId xmlns='http://messaging.ei.tmobile.net/datatypes'>79736010-4e53-42d3-aa5a-6dd9b9e98df1
                </correlationId>
            </eiMessageContext>
            <data>
                <MT_EQDATA_RESPV2>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212879995</HEQUI>
                        <HEQNR>0056</HEQNR>
                        <ASB>1</ASB>
                        <TPLNR>000031-000000-001-004-002-021</TPLNR>
                        <EQART>G</EQART>
                        <ANZ_EBENEN>1</ANZ_EBENEN>
                        <EQUNR>212880011</EQUNR>
                        <SERGE>21023533106TG4900198</SERGE>
                        <SUBMT>40247069</SUBMT>
                        <ADR_ID>17056514</ADR_ID>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>001</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880063</EQUNR>
                        <SERGE>H807GP3021580041</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>002</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580042</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>003</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580043</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>004</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580044</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>005</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580045</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>006</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>007</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580047</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>008</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H807GP3021580048</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>009</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H801SC3021580049</SERGE>
                        <SUBMT>40247071</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0010</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H801SC3021580030</SERGE>
                        <SUBMT>40247071</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0011</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H802GP3021580031</SERGE>
                        <SUBMT>40251139</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0012</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H805GP3021580032</SERGE>
                        <SUBMT>40261742</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0019</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H801X23021580033</SERGE>
                        <SUBMT>40247074</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0020</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H801X23021580034</SERGE>
                        <SUBMT>40247074</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/179/76G2</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0021</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>H801PR3021580035</SERGE>
                        <SUBMT>40247072</SUBMT>
                    </EQUI>
                    <KOPF>
                        <PARTNER>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/PARTNER/text()'}}</PARTNER>
                        <ANFO_KEN>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/ANFO_KEN/text()'}}</ANFO_KEN>
                    </KOPF>
                    <STATUS>
                        <LOG_NO>0000000000</LOG_NO>
                        <NUMBER>000</NUMBER>
                        <SYSTEM>Linux</SYSTEM>
                        <LOG_NO>string</LOG_NO>
                        <ID>ZDIB</ID>
                        <MESSAGE>Die Anforderung wurde ausgeführt.</MESSAGE>
                        <TYPE>S</TYPE>
                    </STATUS>
                </MT_EQDATA_RESPV2>
            </data>
        </ns1:MT_EQDATA_RESPV2>
    </SOAP:Body>
</SOAP:Envelope>